{
    "introduce": "I’ve been developing mobile applications since the days of Android Gingerbread in September 2013. I have launched 6 apps and have 10 million downloads. I was in charge of many services.\nStarting from June 2019, I started developing the Flutter framework, and I am doing mobile leading at Lawfully, a startup immigration platform. I have a lot of interest in UI/UX, and I always try to stay ahead by looking into the latest technology trends and new open sources.",
    "titleContact": "Contact",
    "titleIntroduce": "Introduce",
    "titleSkills": "Skills",
    "skillsIntro": "Only the skills that were directly used in the actual product were listed.",
    "fold": "Fold",
    "unfold": "Unfold",
    "developer": "Mobile App Developer",
    "name": "Bansook Nam",
    "namePostFix": "",
    "hello": "Hello I'm\n",
    "project": "Project",
    "patent": "UI/UX Patent",
    "opensource": "Open Source",
    "present": "Now",
    "see story": "See story",
    "SVC description": "The SVC library is a library that improves the problems and inconveniences of the Android MVP pattern that was popular a few years ago.",
    "Nav description": "The Nav library is a library that wraps the Navigator used in Flutter to help you code conveniently with shorter lines and typing. In addition, it contains the basic structure of Dialog, so if you inherit and use it, you can add animation more easily than the general Dialog usage method.",
    "Live Background description": "The Live Background library was developed when we were planning an event to wish our users for the end of the year, and thought it would be nice to put a nice particle bokeh effect in the background. After implementing it, it came out much prettier than I thought and released it as an open source. It is effective when used for pleasant annual promotions such as Christmas and Happy New Year.",
    "patent_1_mini_player desc": "This is a function proposed to utilize the space of the mini player at the bottom of the audio clip application. It was proposed to efficiently use the small mobile screen, and appropriate animation effects were used so that users did not experience any inconvenience.",
    "patent_2_audio_clip desc": "Practical patents for the overall structure of \"Audio Clip\" services and applications, as well as players and content viewers.",
    "patent_3_soundpost desc": "When I was in charge of the Naver Post service, I proposed and designed a function called \"Sound Post\" and applied for a patent with the developers who developed the function itself.",
    "project_0 cafe desc": "Naver Cafe is the largest community platform in Korea. You can talk to each other and share useful information, such as various hobbies, expertise, and sports.",
    "project_1 post desc": "Naver Post has a similar texture to a blog service, but is a little more specialized, and is a platform that continuously writes about a single topic. Posting types include \"regular\" like a blog, and \"card type\" that is flipped sideways. The editor continues to evolve and is currently being serviced as Smart Editor 3.0 (One).",
    "project_2 blog desc": "Naver Blog is the largest blogging platform in Korea. It serves as a platform for sharing users' daily life information and professional contents.",
    "project_3 disco desc": "Disco is a service that allows users to share their interests and exchange information. It was developed for Korea and Japan, and a pilot service was introduced in Korea, but it ended in six months as the atmosphere of the early box office cooled.",
    "project_4 audioclip desc": "Audioclip is a content service that allows you to easily enjoy audio content in your area of interest, from lectures in various fields, fairy tales, language studies, exhibition docents, to audio books, news, and sports events.",
    "project_5 selective desc": "Selective (currently Naver Shopping Live) was initially planned and launched as a platform for general users to share each other's fashion photos.",
    "project_6 lawfully desc": "The Lawfully application service is a service that guides immigrants on what to do at each step of the staff when they apply through USCIS (Federal Immigration Service) and predicts the date when approval will be given based on user data. In addition, we provide 1:1 video consultation with lawyers, former USCIS interviews, mock practice/coaching services, and in-depth data analysis to paid premium users.",
    "project_0 cafe story1 title": "Android? Growth of a novice developer",
    "project_0 cafe story1": "I completed the 4th Naver non-major training program, and was very fortunate to be accepted as an intern.\nI didn't go to the html5-based Naver Mail team, which I wanted first, but went to the Naver Cafe Android team, which I wanted second.\n\n Since I was an intern, I didn't have access to the actual product code, but instead developed various prototypes using the Naver Cafe Open API. From implementing OAuth authentication, to developing features that would be nice to have in the app, such as a bulletin board search function and Quick Search Bar, we had time to make a presentation in front of the development team leader and receive feedback.",
    "project_1 post story1 title": "I was really lucky.",
    "project_1 post story1": " After the internship period was over and the final interview was over, I thought it was because I didn't get in touch. But luckily, the news of my acceptance came via text message and phone call.\n I also met great mentors. Always kindly let me know if there's anything I don't know, and more than that, I've shared links and documents. I have many good memories with my seniors, but there are also embarrassing and apologetic memories of getting into trouble and insisting on coming back in my younger days. Thanks to the people I'm thankful for, I was able to put into practice in a short time and grow quickly.\n Since the post app had only been released for a few months, there were so many things to do. I had to work overtime to digest it within the schedule, and I had to struggle with concentration because of unresolved problems.",
    "project_1 post story2 title": "Editor",
    "project_1 post story2": "Since the writing function was the most important post, there was a lot of editor-related work. It also had the ability to create post covers, just like book covers, and download and view content for offline viewing.",
    "project_1 post story3 title": "Gallery Picker",
    "project_1 post story3": "Since we also had to develop a function to select images built into the smartphone, we developed and implemented a screen called the gallery picker. Solved the problem by memory dumping, analyzing, and optimizing the image decoding options. This basic picker was useful, so it was later reused on Naver Blog and used in Smart Editor 3.",
    "project_1 post story4 title": "Early Adapter",
    "project_1 post story4": "I have always been interested in new technologies and trends. There were two things I introduced on the post team. Git, Android Studio.\nWhen I joined the team, I was using the company's SVN system. Because of this, it was a heavy system that downloads and uploads all the files in the branch as well as the changes when moving or merging branches.\n The team members knew that Git was good, but it was not easy to move it. I found out that it is possible to migrate while maintaining the existing history by perusing the documentation for migrating to Git after receiving permission from the Android team leader and testing it locally. In the end, we successfully introduced Git.\nAlso, when Android Studio was first released, I tried using it faster than anyone else and summarized the pros and cons to convince the team members. And when I moved from Eclipse to Android Studio, I organized the necessary settings and know-how and organized them on the company bulletin board, and I was very proud to hear that many teams thanked me via messenger.",
    "project_1 post story5 title": "Sound Post",
    "project_1 post story5": "Post had a flipping card editor/viewer. I always thought it would be nice to have someone read it as a narration or have background music while watching this. I talked to the planning team a lot, but more important things were prioritized, so I was just floating around as a fun idea.\n\n One day, Han Seong-sook, general manager of the service, asked Naver Band \"Is there any good way to beat Facebook?\" You left such a comment, but I made the idea more concrete that day and made and uploaded a video that automatically skips with background music and my voice.\n The response was better than I thought, \"Why have we been so static until now? I wonder if I was focusing too much on the text.” I received this kind of feedback. That's it. I was selected as a PM and Android developer at the time, and while communicating with the design team, legal advisory team, and PR team, I completed the development in about two months and successfully launched it. Mothers and people with good voices (voice actors) uploaded about 5,000 storytelling contents.",
    "project_2 blog story1 title": "Gallery Picker",
    "project_2 blog story1": " Smart Editor is a core function of NAVER with a long history.\n By using it in blogs, Naver posts, magazines, etc., long articles can be read and expressed nicely.\n I am working on creating an image selection gallery for Smart Editor 3.0. \n\n Other than that, I mainly did sustain work to fix various bugs and crashes for a short period of time.",
    "project_3 disco story1 title": "Service Disco (originally named UP)",
    "project_3 disco story1": " Naver's symbol Green Factory, and went up to the top of the 27th floor. When I opened the mysterious door and entered, my colleagues at Naver Post greeted me enthusiastically.\n\n While I was working on sustain after launching Sound Post at Naver Post, the Naver Post mobile developers worked with Japan Line. Everyone was invested in this ongoing project and was in the middle of development.\n\n I used the NAVER Maps API to design a custom UI using GPS coordinates, and was in charge of a regional viewer.\n\n MVP, which was popular at the time. I developed it together with the concept of Presenter and Interactor by combining patterns and MVI patterns, but I felt that only complexity was induced, and rather, I was hindered in understanding the context. However, at the time, I didn't know what exactly caused these symptoms, and I did my best to develop my duties within this structure that the team members had prepared in advance.\n\n With the release just around the corner, my resources were running out of resources. So, I went back to the original team for about a month to work on Naver Blog/Post Sustain.\n\n And... (see audio clip story)",
    "project_4 audioclip story1 title": "The first Commit and Father of Audioclips",
    "project_4 audioclip story1": "About a year after launching Sound Post on Naver, the head of the Community Development Lab quietly called me and informed me that they were urgently planning an audio service and that development would begin soon, and suggested that we move the team from next week. You did.\n Since I had always had an affection for the blog/post service itself, I carefully refused because I wanted to stay and upgrade the sound post function, but CEO Han Seong-sook, who was the service manager at the time, pointed me out and told me that it would be better to go. The team was moved semi-forcibly (?).\n With the initial design and planning materials that were available at the time, we made the first prototype app and showed a demo demonstration. In addition, people from various other service teams gathered, and development was really fun and lively.\n I didn't read Android because I didn't have a lot of years, but I took a senior who had been working on Android for a long time as a leader, and the roles were distributed well.\n\n I suggested that I really want to do the basic architecture, and under the conditions of the leader's inspection, I developed the structure in the form of the basic framework of the open source SVC, and that's how the first version was released on the store.\n\n I was the first one to commit, and because of the invention of the sound post, the audio clip service was also planned and carried out, so my teammates used to jokingly call me the father of audio clips and the father of sound posts.",
    "project_4 audioclip story2 title": "Early Adapter22",
    "project_4 audioclip story2": "I introduced Kotlin for the first time to our Android project. When I used it as a prototype, the code became very concise compared to java, and I was able to express it in a variety of ways using the Lambdas with Receivers, etc. Also, since we were able to communicate with each other without affecting the existing code, we decided to adapt Kotlin gradually by persuading the team leader and team members.",
    "project_4 audioclip story3 title": "Speech recognition natural language processing",
    "project_4 audioclip story3": " After the release of the audio clip, planning requests suddenly fell. Audio technology should be shown in the Audio Clip app, but it is necessary to enter the voice recognition function, but there is no manpower or time to develop it. It was a situation where I had to release it in about 1.5 months, and no one stepped forward, but I wanted to try it as far as I could develop. \n\n In fact, to develop in a sustainable form, we need to have a machine learning-based command analysis system, but since there was no time to train the machine and implement it in the app, the machine learning-based middle part was postponed until later, and voice It is designed in such a way that the recognition module is attached to receive a sentence, sent to the server for analysis, and then it gives a scheme command that can be executed in the app.\n\nI receive the sentence parsed from the server and turn it into a noun, A function that converts into a scheme by splitting into auxiliary verbs, investigations, verbs, object investigations, etc., and identifying the user's intention through a combination of commands that can be executed in the app (play, play, find, move) was developed in JAVA and contributed to the server team's Repository.\n When the implementation was completed and tested, the possible commands worked well with a success rate of 90% or more (based on the commands according to the provided guide), so the audio I was able to apply the same function to Naver Music service as well as clips.",
    "project_5 selective story1 title": "Android Architecting",
    "project_5 selective story1": " When I joined the team, I implemented the basic architecture of Android photo/video editing editor and photo filter function. Since there was a .SO native filter made by the Naver Labs team, NDK was linked to implement various filters and crop functions for photos, and the Gallery Picker, which was created directly from Naver posts and blogs, was provided with a customized design.\n\n Also, while discussing the structure of the SVC pattern, which was released as an open source at the time, with the team, the parts that did not understand each other changed the structure, and the action class that was useCase was renamed viewsAction to create a clearer form. And by changing the screens before joining to the SVC structure, the code was simplified.",
    "project_5 selective story2 title": "React Web development",
    "project_5 selective story2": " After 6 years of Android development, I was able to contribute to the React web project for about 3 months for the first time. At the time, Redux was used frequently, but the animation that appears when clicking the Like heart was recursive in data processing, so there was a stutter that was uncomfortable to the eye. We identified the cause of this and solved the problem by refactoring the animation into a form that does not use Redux separately. In addition, the influencer registration page and promotion page were developed by dividing the work with the person in charge of markup.\n\n It was a short time, but it was a time when I was able to understand the declarative UI, which is completely different from the existing Android UI development, and kotlin It was a good time to experience the free structure and grammar of JavaScript that was not available in .",
    "project_6 lawfully story1 title": "Early days story",
    "project_6 lawfully story1": " I joined Lawfully on June 27, 2019 to lead Android development. I have an Android app I'm working on, and I decided to complete the project and launch it on the store.\n\n At the time of joining the company, the iOS app developed for 1 year and 4 months from February 2018 was launched on the store, and in December 2018 The app released on was an early new application with about 7,000 members and only about 100 DAUs by the time I joined.\n\n However, when I joined the company, the iOS developer who was leading the app project had left the company and was absent. I was supposed to take over the source code and get a distribution-related profile, but I couldn't get in touch and I fell into a mental breakdown. I only looked at the code of the git repository that was delivered.\n\n Even the Android app, which was being developed through outsourcing, was developed only about 40% of the development target (iOS specification at the time), and the structure or code was too difficult to develop the rest. It was a mess too.",
    "project_6 lawfully story2 title": "Our Flutter",
    "project_6 lawfully story2": " Since there is no one to lead the iOS, and the Android side should continue, it seemed that it would be quicker to set up a structure from the beginning. At the time, Flutter was gradually emerging as a cross-platform that I was interested in, and it has been about 6 months since 1.0.0 was released. The more research I do, the more UI performance and Flutter that detaches UI dependency from the OS platform. 'Ah! I wanted to do this.\n\n At that time, the iOS app itself had to constantly change and update its functions, so I studied Swift at the same time and released about 10 iOS apps for about 3 months. I worked hard to create an iOS app with Flutter.\n\n Finally, on October 21, 2019, the Android Flutter version app was released. Subsequently, in early November, the Flutter app that migrated the login information of the native iOS app was updated on the AppStore. iOS users thought only the design had changed a little. I had no idea that the whole interior had been changed.\n\n Looking back over the past four years, choosing Flutter was a godsend. You only need to make one set for planning, design, and text delivery, and the development speed itself is faster than native development (Hot reload). Even if you don't test Android/iOS twice after development, 99% of the functions work the same. Therefore, the overall efficiency of the company is not simply 50%, but considering the communication cost, the company was able to shorten the release cycle by function while saving about 70%.",
    "project_6 lawfully story3 title": "Implementation of various functions and technologies",
    "project_6 lawfully story3": "As I became familiar with Flutter development, and as various libraries were released, video chatting with lawyers (Agora) and credit card payment (Stripe) became easy to link, I was able to realize functions that I had only planned.\n\n Other than that, in Firebase, Through the provided A/B testing or interworking with Firestore functions, it was easy to create a Firestore DB data structure and develop a chat function directly.",
    "project_6 lawfully story4 title": "Now is",
    "project_6 lawfully story4": "Lawfully has a total of 1.4M downloads, 2.6M registered user cases, and 430K MAUs. In 4 years, we have grown by 60000% in terms of users. It is becoming more and more known through word of mouth among immigrating users, and more is expected in the future.",
    "sort recent": "Sort by Newest",
    "sort old": "Sort by Oldest",
   "media": "Speach & Media"
}