{
    "introduce": "I’ve been developing mobile applications since the days of Android Gingerbread in September 2013. I have launched 6 apps and have 10 million downloads. I was in charge of many services.\nStarting from June 2019, I started developing the Flutter framework, and I am doing mobile leading at Lawfully, a startup immigration platform. I have a lot of interest in UI/UX, and I always try to stay ahead by looking into the latest technology trends and new open sources.",
    "titleContact": "Contact",
    "titleIntroduce": "Introduce",
    "titleSkills": "Skills",
    "skillsIntro": "Only the skills that were directly used in the actual product were listed.",
    "fold": "Fold",
    "unfold": "Unfold",
    "developer": "Mobile App Developer",
    "name": "Bansook Nam",
    "namePostFix": "",
    "hello": "Hello I'm\n",
    "project": "Project",
    "patent": "UI/UX Patent",
    "opensource": "Open Source",
    "present": "Now",
    "see story": "See story",
    "SVC description": "The SVC library is a library that improves the problems and inconveniences of the Android MVP pattern that was popular a few years ago.",
    "Nav description": "The Nav library is a library that wraps the Navigator used in Flutter to help you code conveniently with shorter lines and typing. In addition, it contains the basic structure of Dialog, so if you inherit and use it, you can add animation more easily than the general Dialog usage method.",
    "Live Background description": "The Live Background library was developed when we were planning an event to wish our users for the end of the year, and thought it would be nice to put a nice particle bokeh effect in the background. After implementing it, it came out much prettier than I thought and released it as an open source. It is effective when used for pleasant annual promotions such as Christmas and Happy New Year.",
    "patent_1_mini_player desc": "This is a function proposed to utilize the space of the mini player at the bottom of the audio clip application. It was proposed to efficiently use the small mobile screen, and appropriate animation effects were used so that users did not experience any inconvenience.",
    "patent_2_audio_clip desc": "Practical patents for the overall structure of \"Audio Clip\" services and applications, as well as players and content viewers.",
    "patent_3_soundpost desc": "When I was in charge of the Naver Post service, I proposed and designed a function called \"Sound Post\" and applied for a patent with the developers who developed the function itself.",
    "project_0 cafe desc": "Naver Cafe is the largest community platform in Korea. You can talk to each other and share useful information, such as various hobbies, expertise, and sports.",
    "project_1 post desc": "Naver Post has a similar texture to a blog service, but is a little more specialized, and is a platform that continuously writes about a single topic. Posting types include \"regular\" like a blog, and \"card type\" that is flipped sideways. The editor continues to evolve and is currently being serviced as Smart Editor 3.0 (One).",
    "project_2 blog desc": "Naver Blog is the largest blogging platform in Korea. It serves as a platform for sharing users' daily life information and professional contents.",
    "project_3 disco desc": "Disco is a service that allows users to share their interests and exchange information. It was developed for Korea and Japan, and a pilot service was introduced in Korea, but it ended in six months as the atmosphere of the early box office cooled.",
    "project_4 audioclip desc": "Audioclip is a content service that allows you to easily enjoy audio content in your area of interest, from lectures in various fields, fairy tales, language studies, exhibition docents, to audio books, news, and sports events.",
    "project_5 selective desc": "Selective (currently Naver Shopping Live) was initially planned and launched as a platform for general users to share each other's fashion photos.",
    "project_6 lawfully desc": "The Lawfully application service is a service that guides immigrants on what to do at each step of the staff when they apply through USCIS (Federal Immigration Service) and predicts the date when approval will be given based on user data. In addition, we provide 1:1 video consultation with lawyers, former USCIS interviews, mock practice/coaching services, and in-depth data analysis to paid premium users.",
    "project_0 cafe story1 title": "",
    "project_0 cafe story1": "",
    "project_1 post story1 title": "초보 개발자의 성장",
    "project_1 post story1": "정말 운이 좋게도 네이버 인턴을 마치고 최종 합격을 하였습니다. 너무 연락이 오지 않아서 떨어진줄 알았습니다.\n저는 1순위로 지망했던 html5 기반의 네이버 메일 팀으로 가지는 못했고, 2순위로 지망한 네이버 포스트 Android 개발자로 뽑혀갔습니다.\n\n이것이 모바일 개발자로 계속 이어지게한 계기가 되었습니다.\n또 정말 운이 좋게도 좋은 멘토님들을 만났습니다. 모르는게 있으면 항상 친절하게 알려주시고, 그보다가 더 많은 것들을 링크와 문서로 공유받았습니다. 선배님들과 많은 좋은 기억들이 있지만 말썽 부리고 젊은날에 오기를 부렸던 부끄럽고 죄송한 기억들도 있습니다. 고마운분들 덕분에 짧은 시간에 실무에 바로 투입할 수 있었고 빠르게 성장할 수 있었습니다.\n포스트 앱이 출시된지 몇달이 되지 않았기 때문에, 해야될 일들이 정말 많았습니다. 일정 안에 소화하려면 야근도 해야했고, 또 풀리지 않는 문제들 때문에 집중력과 씨름했어야 했습니다.",
    "project_1 post story2 title": "에디터",
    "project_1 post story2": "포스트는 글쓰는 기능이 가장 중요했기때문에 에디터 관련 작업이 많았습니다. 책 표지와 같이 포스트 표지도 만들고 컨텐츠를 오프라인으로 볼 수 있게 다운로드하여 보는 기능도 있었습니다(현재는 사라진 기능).",
    "project_1 post story3 title": "갤러리 피커",
    "project_1 post story3": "스마트폰에 내장된 이미지를 선택하는 기능도 개발해야했기 때문에, 갤러리 피커라는 화면을 개발해서, 구현하였고 기존에 사용하던 갤러리는 로딩 속도가 너무 느리고, 스크롤이 버벅였기 때문에 당시 Eclipse IDE로 프로파일링하여 메모리 덤핑을 하고 분석하여서, 이미지 디코딩 옵션을 최적화해서 문제를 해결했습니다. 이 기본 피커는 쓰임새가 좋아서, 추후에 네이버 블로그에서도 재활용하여 스마트 에디터3에도 사용되었습니다.",
    "project_1 post story4 title": "얼리 어답터",
    "project_1 post story4": " 평소에 새로운 기술이나 트랜드에 관심이 많았습니다. 제가 포스트 팀에서 도입한건 2가지였습니다. Git, Android Studio.\n팀에 참여했을때는 회사의 SVN 시스템을 사용하고 있었습니다. 때문에 브랜치를 이동할때나 머지를 할때 변경사항뿐 아니라 해당 브랜치의 모든 파일을 다운받고, 업로드하는 무거운 시스템이었습니다.\nGit이 좋다는건 팀원들도 들어서 알고는 있었지만, 옮기는게 쉽지는 않았습니다. 안드로이드 팀장님께 리소스 허락을 받아서 Git으로 Migration하는 문서들을 정독하고 실제 로컬에서 테스트를 해보면서 기존의 히스토리를 유지하면서 옮기는게 가능하다는 사실을 알게됐습니다. 결국 성공적으로 Git을 도입했습니다.\n또 처음 Android Studio가 공개되었을때 누구보다도 빠르게 사용을 해보고, 장단점을 정리하여 팀원들을 설득했습니다. 그리고 Eclipse에서 Android Studio로 넘어올때 필요한 설정들과 노하우들을 정리하여 사내 게시판에 정리하였고, 많은 팀들이 고맙다는 이야기를 메신저로 전해주어 굉장히 뿌듯했습니다.",
    "project_1 post story5 title": "사운드 포스트",
    "project_1 post story5": "포스트에는 넘겨보는 카드형 에디터/뷰어가 있었습니다. 전 항상 이걸 보면서 여기에 누군가가 나레이션으로 읽어주거나 배경 음악이 나오면 좋겠다는 생각이 있었습니다. 기획팀에도 많이 이야기해봤지만 더 중요한 일들이 우선순위에 있었기 때문에 그냥 재밌는 아이디어로 떠돌고 있었죠.\n\n어느날 한성숙 서비스 총괄이사님이 네이버 밴드에 \"페이스북을 이길 수 있는 좋은 방법은 없을까요?\" 이런 댓글을 남기셨는데, 그날 아이디어를 더 구체화해서 아예 배경음악과 제 목소리를 입혀서 자동으로 넘어가는 동영상을 제작해서 올렸습니다.\n생각보다 반응이 너무 괜찮았고, /”우리가 왜 이제껏 정적인 텍스트에만 너무 집중하고 있었을까요/” 이런 피드백을 받았습니다. 기획과 사운드 포스트 에디터에 대한 구체적인 UI 기획을 다듬고, 미팅을 주최하였는데 프로젝트로 선정이 됐습니다. 저는 당시 PM이자 안드로이드 개발자로 선택되어서 디자인 팀과, 법률 자문팀, 홍보팀 등과 소통하면서 약 2달만에 개발을 끝내고 성공적으로 출시를 하였습니다.\n\n이 기능으로 가지고 핑크퐁과 동화구연 대회를 하여 많은 어머님들과 목소리 좋은 분들(성우급)이 약 5천개의 구연동화 컨텐츠를 올리기도 했습니다.",
    "project_2 blog story1 title": "갤러리 픽커",
    "project_2 blog story1": "스마트에디터는 오래된 역사를 가진 네이버의 핵심 기능입니다.\n블로그와, 네이버 포스트, 매거진 등에서 활용하여 긴 글을 읽기 좋고 멋지게 표현할 수 있죠.\n저는 스마트 에디터 3.0에 들어가는 이미지 선택 갤러리를 만드는 작업을 했습니다.\n\n그 외에 다양한 버그나, 크래시 등을 고치는 서스테인 업무를 주로 짧은 기간동안 진행하였습니다.",
    "project_3 disco story1 title": "서비스 Disco (최초에 이름은 UP)",
    "project_3 disco story1": " 네이버의 상징 그린팩토리, 그리고 27층 꼭대기로 올라갔습니다. 베일에 쌓여있는 비밀문을 열고 들어가니 네이버 포스트에서 같이 일하던 동료들이 저를 격렬히 맞이해주었습니다.\n\n 제가 네이버 포스트에서 사운드 포스트를 출시하고 서스테인 업무를 하는동안 네이버 포스트 모바일 개발진들은 일본 라인과 함께 진행하는 이 프로젝트에 모두 투입되어서 한창 개발을 하고 있었습니다.\n\n 저는 네이버 지도 API를 사용해 GPS 좌표를 활용한 커스텀 UI 디자인과, 지역 Viewer를 맡아서 작업을 했습니다.\n\n 당시에 유행하던 MVP 패턴과 MVI 패턴을 조합하여 Presenter와 Interactor라는 개념을 가지고 함께 개발을 하였는데, 복잡성만 유발되고, 오히려 맥락을 이해하는데 방해를 받는 느낌이 들었습니다. 하지만 당시에는 정확하게 어떤 부분 때문에 이러한 증상이 느껴졌는지 몰랐고, 팀원들이 미리 잡아주신 이 구조 안에서 최선을 다해 맡은바 개발을 진행했습니다.\n\n 출시가 얼마 안남은 시점에, 제 리소스는 남아 할게 없어졌기 때문에, 다시 네이버 블로그/포스트 서스테인 업무를 하기위해 1달정도 원래 팀으로 돌아갔습니다.\n\n그리고… (오디오 클립 스토리를 봐주세요)",
    "project_4 audioclip story1 title": "최초의 커밋 그리고 오디오클립의 아버지",
    "project_4 audioclip story1": "네이버에서 사운드 포스트를 런칭하고 약 1년 후, 커뮤니티 개발랩 랩장님이 조용히 부르시더니 지금 급하게 오디오 서비스를 기획하고 있고 조만간 개발이 들어갈 거라고 저에게 귀띔해주셨고, 다음주부터 팀을 옮기는게 어떻겠냐고 제안을 해주셨습니다.\n 저는 블로그/포스트 서비스 자체에 계속 애정이 있었기 때문에 남아서 사운드 포스트 기능을 더 업그레이드 시키고  싶은 마음에 조심스럽게 거절하였으나, 당시 서비스 총괄님이셨던 한성숙 대표님이 저를 지목했다고 꼭 가는게 좋겠다고 이야기해주셔서 반강제로(?) 팀을 이동하였습니다.\n 당시 나와있던 최초 디자인과 기획물을 가지고 첫 프로토타입 앱을 만들고 데모 시범을 보여드렸었고, 실제 프로덕으로 진행하기로 결정이 나면서, 네이버 뮤직팀과 또 기타 여러 서비스 팀에서 사람들이 모였고 함께 개발을 정말 재밌고 활기차게 진행했습니다.\n 연차가 많지 않아 안드로이드 리딩을 하지는 않았지만, 오래 안드로이드를 해오신 선배님을 리더로 모시면서 역할 분배된데로 잘 이어나갔습니다.\n\n 저는 기초 아키텍팅을 제가 꼭 하고 싶다고 제안하였고, 리더님이 검수해주시는 조건하에 오픈소스 SVC의 기본 틀이 되는 형태로 구조를 잡아서 개발하였고, 그렇게 첫번째 버전이 스토어에 출시가 되었습니다.\n\n 첫번째로 커밋을 한 사람이 저였고, 사운드 포스트의 발명으로 인해서, 오디오 클립 서비스도 기획되고 진행되었기 때문에 팀원들이 저를 오디오클립의 아버지, 사운드 포스트의 아버지라고 우스갯 소리로 부르곤 했습니다.",
    "project_4 audioclip story2 title": "음성 인식 자연어 처리",
    "project_4 audioclip story2": "오디오 클립 출시 후에 급작스럽게 기획 요청이 떨어졌습니다. 오디오 기술력을 오디오 클립 앱에서 보여주어야하는데, 음성 인식 기능이 들어가는게 필요한데, 이를 개발할 수 있는 인력이나 시간이 없다는 것이었습니다. 약 1.5달 안에 출시를 해야하는 상황이었고, 누구도 나서지 않았으나 제가 개발할 수 있는 선에서는 해보고 싶었습니다. \n\n지속 가능한 형태로 개발을 하려면 사실 머신러닝 기반의 명령 분석 시스템을 갖추어야하는데, 머신을 훈련 시키고 앱에서 구현될때까지의 시간은 없었기 때문에, 머신러닝 기반의 중간 부분은 나중으로 미루고, 음성인식 모듈을 붙여서 문장을 받고, 이를 서버에 보내서 분석하게 한 뒤에 앱에서 실행할 수 있는 스킴 명령을 내려주는 형태로 설계했습니다.\n\n저는 서버에서 음성을 파싱한 문장을 받고 그 문장을 명사,조동사,조사,동사,목적격조사(을/를) 등으로 쪼개고 앱에서 실행 가능한 명령들의(재생해, 틀어줘, 찾아줘, 이동해줘) 조합을 통해 유저의 의도를 파악해서 스킴으로 변환시켜주는 기능을 JAVA로 개발하여 서버팀의 Repository에 기여했습니다.\n 구현을 완료하고 테스트했을때 기대했던 것 보다 가능한 명령들이 90%이상 성공률로 잘 동작하였기 때문에(제공한 가이드에 따른 명령들 기준), 오디오클립뿐 아니라 네이버 뮤직 서비스에도 동일한 기능을 붙여서 활용할 수 있었습니다.",
    "project_5 selective story1 title": "Android 아키텍팅",
    "project_5 selective story1": "저는 팀에 합류할때 안드로이드 사진/동영상 편집 에디터의 기초 아키텍처와 사진 필터 기능등을 구현했습니다. 네이버 랩스팀이 만들어준 .SO 네이티브 필터가 있었기 때문에 NDK연동을 해서 사진에 다양한 필터와, Crop 기능 등을 구현하였고, 네이버 포스트와 블로그에서 직접 만들었던 Gallery Picker를 디자인 커스터마이징하여 제공했습니다.\n\n또 당시 오픈소스로 공개했던 SVC 패턴 구조에 대해 팀과 논의하면서 서로 이해가 안되는 부분들은 구조를 변경하고 useCase였던 액션 클래스를 viewsAction이라는 이름으로 고치면서 더 명확한 형태를 만들었습니다. 그리고 합류하기 전에 있었던 화면들을 SVC 구조로 변경하면서, 코드를 단순화시켰습니다.",
    "project_5 selective story2 title": "React 웹 개발",
    "project_5 selective story2": "Android 개발만 6년을 해오다가 처음으로 React 웹프로젝트에 3달정도 기여를 할 수 있었습니다. 당시에 Redux를 빈번하게 사용하는 구조였는데, 좋아요 하트를 누를때 나오는 애니메이션이 데이터 처리가 Recursive하게 수행이되면서 눈에 보기 불편할 정도로 버벅임이 있었습니다. 이 원인을 파악하고, 또 애니메이션만 별도로 Redux를 사용하지 않는 형태로 리팩토링하여 문제를 해결했습니다. 그 외에 인플루언서 등록 페이지와 프로모션 페이지 등을 마크업 담당자와 분업하여 개발하였습니다.\n\n 짧은 시간이었지만 기존의 Android UI 개발과 전혀 다른 선언형 UI에 대한 이해를 할 수 있었던 시간이고, kolin에는 없던 자바스크립트의 자유로운 구조와 문법을 경험할 수 있었던 좋은 시간이었습니다. ",
     "media": "Speach & Media"
}