{
    "introduce": "I’ve been developing mobile applications since the days of Android Gingerbread in September 2013. I have launched 6 apps and have 10 million downloads. I was in charge of many services.\nStarting from June 2019, I started developing the Flutter framework, and I am doing mobile leading at Lawfully, a startup immigration platform. I have a lot of interest in UI/UX, and I always try to stay ahead by looking into the latest technology trends and new open sources.",
    "titleContact": "Contact",
    "titleIntroduce": "Introduce",
    "titleSkills": "Skills",
    "skillsIntro": "Only the skills that were directly used in the actual product were listed.",
    "fold": "Fold",
    "unfold": "Unfold",
    "developer": "Mobile App Developer",
    "name":"Bansook Nam",
    "namePostFix":"",
    "hello": "Hello I'm\n",
    "project": "Project",
    "patent": "UI/UX Patent",
    "opensource": "Open Source",
    "present": "Now",
    "see story": "See story",
    "SVC description": "The SVC library is a library that improves the problems and inconveniences of the Android MVP pattern that was popular a few years ago.",
    "Nav description": "The Nav library is a library that wraps the Navigator used in Flutter to help you code conveniently with shorter lines and typing. In addition, it contains the basic structure of Dialog, so if you inherit and use it, you can add animation more easily than the general Dialog usage method.",
    "Live Background description": "The Live Background library was developed when we were planning an event to wish our users for the end of the year, and thought it would be nice to put a nice particle bokeh effect in the background. After implementing it, it came out much prettier than I thought and released it as an open source. It is effective when used for pleasant annual promotions such as Christmas and Happy New Year.",
    "patent_1_mini_player desc": "This is a function proposed to utilize the space of the mini player at the bottom of the audio clip application. It was proposed to efficiently use the small mobile screen, and appropriate animation effects were used so that users did not experience any inconvenience.",
    "patent_2_audio_clip desc": "Practical patents for the overall structure of \"Audio Clip\" services and applications, as well as players and content viewers.",
    "patent_3_soundpost desc": "When I was in charge of the Naver Post service, I proposed and designed a function called \"Sound Post\" and applied for a patent with the developers who developed the function itself.",
    "media": "Speach & Media"
}