{
    "introduce": "I’ve been developing mobile applications since the days of Android Gingerbread in September 2013. I have launched 6 apps and have 10 million downloads. I was in charge of many services.\nStarting from June 2019, I started developing the Flutter framework, and I am doing mobile leading at Lawfully, a startup immigration platform. I have a lot of interest in UI/UX, and I always try to stay ahead by looking into the latest technology trends and new open sources.",
    "titleContact": "Contact",
    "titleIntroduce": "Introduce",
    "titleSkills": "Skills",
    "skillsIntro": "Only the skills that were directly used in the actual product were listed.",
    "fold": "Fold",
    "unfold": "Unfold",
    "developer": "Mobile App Developer",
    "name": "Bansook Nam",
    "namePostFix": "",
    "hello": "Hello I'm\n",
    "project": "Project",
    "patent": "UI/UX Patent",
    "opensource": "Open Source",
    "present": "Now",
    "see story": "See story",
    "SVC description": "The SVC library is a library that improves the problems and inconveniences of the Android MVP pattern that was popular a few years ago.",
    "Nav description": "The Nav library is a library that wraps the Navigator used in Flutter to help you code conveniently with shorter lines and typing. In addition, it contains the basic structure of Dialog, so if you inherit and use it, you can add animation more easily than the general Dialog usage method.",
    "Live Background description": "The Live Background library was developed when we were planning an event to wish our users for the end of the year, and thought it would be nice to put a nice particle bokeh effect in the background. After implementing it, it came out much prettier than I thought and released it as an open source. It is effective when used for pleasant annual promotions such as Christmas and Happy New Year.",
    "patent_1_mini_player desc": "This is a function proposed to utilize the space of the mini player at the bottom of the audio clip application. It was proposed to efficiently use the small mobile screen, and appropriate animation effects were used so that users did not experience any inconvenience.",
    "patent_2_audio_clip desc": "Practical patents for the overall structure of \"Audio Clip\" services and applications, as well as players and content viewers.",
    "patent_3_soundpost desc": "When I was in charge of the Naver Post service, I proposed and designed a function called \"Sound Post\" and applied for a patent with the developers who developed the function itself.",
    "project_0 cafe desc": "Naver Cafe is the largest community platform in Korea. You can talk to each other and share useful information, such as various hobbies, expertise, and sports.",
    "project_1 post desc": "Naver Post has a similar texture to a blog service, but is a little more specialized, and is a platform that continuously writes about a single topic. Posting types include \"regular\" like a blog, and \"card type\" that is flipped sideways. The editor continues to evolve and is currently being serviced as Smart Editor 3.0 (One).",
    "project_2 blog desc": "Naver Blog is the largest blogging platform in Korea. It serves as a platform for sharing users' daily life information and professional contents.",
    "project_3 disco desc": "Disco is a service that allows users to share their interests and exchange information. It was developed for Korea and Japan, and a pilot service was introduced in Korea, but it ended in six months as the atmosphere of the early box office cooled.",
    "project_4 audioclip desc": "Audioclip is a content service that allows you to easily enjoy audio content in your area of interest, from lectures in various fields, fairy tales, language studies, exhibition docents, to audio books, news, and sports events.",
    "project_5 selective desc": "Selective (currently Naver Shopping Live) was initially planned and launched as a platform for general users to share each other's fashion photos.",
    "project_6 lawfully desc": "The Lawfully application service is a service that guides immigrants on what to do at each step of the staff when they apply through USCIS (Federal Immigration Service) and predicts the date when approval will be given based on user data. In addition, we provide 1:1 video consultation with lawyers, former USCIS interviews, mock practice/coaching services, and in-depth data analysis to paid premium users.",
    "project_0 cafe story1 title": "",
    "project_0 cafe story1": "",
    "project_1 post story1 title": "",
    "project_1 post story1": "",
    "project_2 blog story1 title": "",
    "project_2 blog story1": "",
    "project_3 disco story1 title": "",
    "project_3 disco story1": "",
    "project_4 audioclip story1 title": "",
    "project_4 audioclip story1": "",
    "project_5 selective story1 title": "",
    "project_5 selective story1": "",
    "project_6 lawfully story1 title": "초창기의 이야기",
    "project_6 lawfully story1": "저는 로플리에 2019년 6월 27일에 안드로이드 개발 리드를 하기 위해 합류를 했습니다. 작업중인 안드로이드 앱이 있는데, 그 프로젝트를 완성해서 스토어에 런칭하기로 했죠.\n\n입사 당시에 2018년 2월부터 1년 4개월동안 개발된 iOS 앱이 스토어에 런칭되어있었고,  2018년 12월에 출시된 앱은 제가 입사한 당시까지 약 7000명의 회원에 DAU 100명 정도에 불과한 초기 신생 어플리케이션이었습니다.\n\n 그런데 입사를 했을때 앱 프로젝트를 리딩하시던 iOS 개발자가 퇴사하여 부재중이었습니다. 소스코드를 인수인계 받고 배포 관련 profile 등을 전달 받아야했지만 연락이 안되는 상황이었고 멘붕에 빠졌죠. 유일하게 전달받은 git 저장소의 코드만 바라봤습니다.\n\n 심지어 외주를 통해 개발중이던 안드로이드앱은 개발 목표치의(당시 iOS 스펙의) 40% 정도만 개발이된 상태였고 나머지를 이어서 개발하기에는 구조나 코드도 엉망이었습니다.",
    "project_6 lawfully story2 title": "우리의 Flutter",
    "project_6 lawfully story2": "iOS를 이끌어갈 사람도 없고, Android쪽도 이어서 하자니 처음부터 구조를 잡는게 빠를 것 같았습니다. 당시 제가 관심이 있던 크로스플랫폼으로 Flutter가 점점 떠오르고 있었는데, 1.0.0이 출시된지 이제 6개월 정도가 되었습니다. 리서치를 해볼수록 UI성능과 OS플랫폼에 UI 디펜던시를 떼어낸 Flutter ’아! 이거다’ 싶었습니다.\n\n당시에 iOS앱 자체도 계속 기능 변경과 업데이트를 해야했기 때문에 Swift 공부를 병행해가며 약 3개월동안 10번 정도의 iOS앱 릴리즈를 진행했고, Android앱 출시를 위해서 Flutter로 열심히 iOS앱을 따라 만들었습니다.\n\n드디어 2019년 10월 21일 Android Flutter 버전앱이 출시되었습니다. 뒤따라 11월 초 Native iOS앱의 로그인 정보를 migration한 Flutter 앱을 AppStore에 업데이트 하였습니다. iOS유저들은 디자인만 조금 바뀌었다고 생각했습니다. 내부가 통째로 바뀐줄은 전혀 몰랐죠.\n\n지난 4년을 돌아봤을때 Flutter를 선택한 것은 신의 한수였습니다. 기획과 디자인, 텍스트 전달도 Flutter를 위해 한벌만 만들면 되고, 개발 속도 자체도 Native 개발보다 더 빠르고 (Hot reload), 개발 완료 후의 테스트도 Android/iOS 2번하지 않더라도, 99%의 기능은 동일하게 동작하기 때문에 회사 전반적인 효율이 단순히 50%가 아니라, 커뮤니케이션 비용까지 감안하면 회사 입장에서는 70%정도를 세이브 하면서, 출시 주기를 기능별로 짧게 가져갈 수 있었습니다.",
    "project_6 lawfully story3 title": "다양한 기능들과 기술 구현",
    "project_6 lawfully story3": "Flutter 개발이 익숙해지고, 다양한 library들이 출시되면서 변호사와 화상 채팅이나(Agora) 신용카드 결제(Stripe) 연동이 손쉬워지면서, 계획으로만 가지고 있었던 기능들을 현실화할 수 있었습니다.\n\n그 외에 Firebase에서 제공하는 A/B 테스팅이나 Firestore 기능과의 연동을 통해 Firestore DB 데이터 구조를 만들고 채팅 기능을 직접 개발하는데도 수월하게 진행할 수 있었습니다.",
    "project_6 lawfully story4 title": "지금은",
    "project_6 lawfully story4": "Lawfully는 전체 90만 다운로드, 그리고 등록된 유저 케이스 91만개, MAU 13만명을 기록하고 있습니다. 4년동안 유저 기준으로 8000% 성장을 했습니다. 이민하는 유저들 사이에서도 입소문을 통해 점점 더 알려지고 있으며 앞으로가 더 기대됩니다. ",
    "media": "Speach & Media"
}