{
    "introduce": " 2013년 9월 Android 진저브래드 시절부터 모바일 어플리케이션을 개발해오며, 6개의 앱을 출시하고 1000만 다운로드 국민앱 \"네이버 블로그\", \"오디오 클립\", \"네이버 포스트\" 서비스 등 유저가 많은 서비스를 담당했습니다.\n 2019년 6월부터는 Flutter 프레임워크 개발을 시작하여 스타트업 이민 전문 플랫폼 Lawfully에서 모바일 리딩을 하고 있으며, 단일 프레임워크인 장점을 앞세워서 빠른 개발과 런칭을 통해 다운로드수 50만을 달성하고 UI/UX에 대한 관심이 많고, 늘 최신 기술 트렌드와 새로운 오픈소스들을 들여다보며 앞서나갈 수 있게 힘쓰고있습니다.",
    "titleContact": "연락처",
    "titleIntroduce": "소개",
    "titleSkills": "기술",
    "skillsIntro": "실제 프로덕트에서 직접 사용했던 기술들만 나열했습니다.",
    "fold": "접기",
    "unfold": "펼치기",
    "developer": "모바일 개발자",
    "name": "남반석",
    "namePostFix": "입니다",
    "hello": "안녕하세요.\n",
    "project": "프로젝트",
    "patent": "UI/UX 특허",
    "opensource": "오픈소스",
    "present": "현재",
    "see story": "스토리 보러 가기",
    "SVC description": "SVC 라이브러리는 몇년전에 유행하던 안드로이드 MVP 패턴의 문제점과 불편한 점을 개선한 라이브러리입니다.",
    "Nav description": "Nav 라이브러리는 Flutter에서 사용하는 Navigator를 감싸서 조금더 짧은 줄과 타이핑으로 편리하게 코딩을 도와주는 라이브러리입니다. 그 외에 Dialog 기본 구조를 포함하고 있어서 상속하여 사용하면 일반적인 Dialog 사용 방법보다 쉽게 애니메이션을 추가할 수 있습니다.",
    "Live Background description": "Live Background 라이브러리는 유저들에게 연말 소원을 비는 행사를 기획하다가, 멋진 파티클 보케 효과를 배경으로 깔면 좋을 것 같아서 개발했습니다. 막상 구현하고 나니 생각보다 너무 이쁘게 나와서 오픈소스로 공개했습니다. 크리스마스, Happy New Year 등 기분 좋은 연례 프로모션에 사용하면 효과적입니다.",
    "patent_1_mini_player desc": "오디오 클립 어플리케이션 하단에 미니 플레이어의 공간 활용을 위해 제안한 기능입니다. 작은 모바일 화면을 효율적으로 쓸 수 있도록 제안하였고, 적절한 애니메이션 효과를 사용하여 유저들이 불편을 느끼지 않도록 하였습니다.",
    "patent_2_audio_clip desc": "오디오 클립 서비스 및 어플리케이션의 전반적인 구조와 플레이어, 컨텐츠 뷰어에 대한 실용 특허입니다.",
    "patent_3_soundpost desc": "네이버 포스트 서비스를 담당하고 있을 때  \"사운드 포스트\" 라는 기능을 제안하고 설계하여 기능 자체를 함께 개발한 개발자들과 함께 특허 출원하였습니다.",
    "project_0 cafe desc": "네이버 카페는 국내 최대 커뮤니티 플랫폼입니다. 다양한 취미와 전문 지식, 스포츠 등 서로 이야기를 나누고 유용한 정보를 공유할 수 있습니다.",
    "project_1 post desc": "네이버 포스트는 블로그 서비스와 비슷한 결이 있지만 조금 더 전문적이고, 하나의 주제에 대해 지속적으로 글을 써나가는 플랫폼입니다. 포스팅 종류로는 블로그와 같은 \"일반형\"과, 옆으로 넘겨보는 \"카드형\"이 있습니다. 에디터는 지속적으로 발전하여 현재 스마트 에디터 3.0(One)으로 서비스 되고 있습니다.",
    "project_2 blog desc": "네이버 블로그는 국내 최대 블로깅 플랫폼입니다. 유저들의 일상과 생활 정보 및 전문 컨텐츠 공유 플랫폼으로 서비스되고 있습니다.",
    "project_3 disco desc": "디스코는 유저들의 관심 컨텐츠를 서로 공유하고 정보를 교환하는 서비스입니다. 한국과 일본 대상으로 개발되었고 한국에서 시범 서비스를 도입하였지만 초창기 흥행하던 분위기가 식으면서 6개월만에 종료되었습니다.",
    "project_4 audioclip desc": "오디오클립은 다양한 영역의 강연을 비롯해 동화, 어학, 전시 도슨트뿐 아니라 오디오북, 뉴스, 스포츠 경기에 이르기까지 관심 있는 영역의 콘텐츠를 오디오로 쉽게 즐길 수 있는 컨텐츠 서비스입니다. ",
    "project_5 selective desc": "셀렉티브는(현 네이버 쇼핑라이브) 초창기에 일반 유저들을 대상으로 서로의 패션을 사진으로 공유하는 플랫폼으로 기획되어 출시되었습니다.",
    "project_6 lawfully desc": "로플리 어플리케이션 서비스는 이민자들이 USCIS을(미 연방 이민국) 통해 각종 서류를 통해 지원을 하면, 각 스탭의 단계에서 어떻게 해야할지 안내해주고 유저 데이터에 기반해 언제쯤 승인이 날지 날짜를 예측해주는 서비스입니다. 그 외에 변호사와 1:1 화상 상담 기능과, 전 USCIS 인터뷰와 모의 연습/코칭 서비스, 유료 프리미엄 유저들에게  심층 데이터 분석을 제공하고 있습니다.",
    "project_0 cafe story1 title": "Android? 초보 개발자의 성장",
    "project_0 cafe story1": " 네이버 비전공자 교육 프로그램 4기를 수료하고, 정말 운이 좋게도 인턴으로 합격이 되었습니다.\n저는 1순위로 지망했던 html5 기반의 네이버 메일 팀으로 가지는 못했고, 2순위로 지망한 네이버 Cafe Android팀으로 갔습니다.\n\n 인턴이었기 때문에, 실제 프로덕트 코드에는 접근하진 못했고, 대신 Naver Cafe Open API를 이용하여 다양한 프로토타입을 개발했습니다. OAuth 인증 구현부터, 게시판 검색 기능, Quick Search Bar 등 앱에 있으면 좋을 것 같은 기능들을 개발하고, 개발팀장님 앞에서 발표를 하고 피드백을 받는 시간을 가졌습니다.",
    "project_1 post story1 title": "운이 정말 좋았다.",
    "project_1 post story1": " 인턴 기간이 끝나고 최종 면접 이후  너무 연락이 오지 않아서 떨어진줄 알았습니다. 하지만 정말 운이 좋게도 합격 소식이 문자와 전화로 왔습니다.\n 또 좋은 멘토님들을 만났습니다. 모르는게 있으면 항상 친절하게 알려주시고, 그보다가 더 많은 것들을 링크와 문서로 공유받았습니다. 선배님들과 많은 좋은 기억들이 있지만 말썽 부리고 젊은날에 오기를 부렸던 부끄럽고 죄송한 기억들도 있습니다. 고마운분들 덕분에 짧은 시간에 실무에 바로 투입할 수 있었고 빠르게 성장할 수 있었습니다.\n 포스트 앱이 출시된지 몇달이 되지 않았기 때문에, 해야될 일들이 정말 많았습니다. 일정 안에 소화하려면 야근도 해야했고, 또 풀리지 않는 문제들 때문에 집중력과 씨름했어야 했습니다.",
    "project_1 post story2 title": "에디터",
    "project_1 post story2": " 포스트는 글쓰는 기능이 가장 중요했기때문에 에디터 관련 작업이 많았습니다. 책 표지와 같이 포스트 표지도 만들고 컨텐츠를 오프라인으로 볼 수 있게 다운로드하여 보는 기능도 있었습니다(현재는 사라진 기능).",
    "project_1 post story3 title": "갤러리 피커",
    "project_1 post story3": " 스마트폰에 내장된 이미지를 선택하는 기능도 개발해야했기 때문에, 갤러리 피커라는 화면을 개발해서, 구현하였고 기존에 사용하던 갤러리는 로딩 속도가 너무 느리고, 스크롤이 버벅였기 때문에 당시 Eclipse IDE로 프로파일링하여 메모리 덤핑을 하고 분석하여서, 이미지 디코딩 옵션을 최적화해서 문제를 해결했습니다. 이 기본 피커는 쓰임새가 좋아서, 추후에 네이버 블로그에서도 재활용하여 스마트 에디터3에도 사용되었습니다.",
    "project_1 post story4 title": "얼리 어답터",
    "project_1 post story4": " 평소에 새로운 기술이나 트랜드에 관심이 많았습니다. 제가 포스트 팀에서 도입한건 2가지였습니다. Git, Android Studio.\n팀에 참여했을때는 회사의 SVN 시스템을 사용하고 있었습니다. 때문에 브랜치를 이동할때나 머지를 할때 변경사항뿐 아니라 해당 브랜치의 모든 파일을 다운받고, 업로드하는 무거운 시스템이었습니다.\n Git이 좋다는건 팀원들도 들어서 알고는 있었지만, 옮기는게 쉽지는 않았습니다. 안드로이드 팀장님께 리소스 허락을 받아서 Git으로 Migration하는 문서들을 정독하고 실제 로컬에서 테스트를 해보면서 기존의 히스토리를 유지하면서 옮기는게 가능하다는 사실을 알게됐습니다. 결국 성공적으로 Git을 도입했습니다.\n또 처음 Android Studio가 공개되었을때 누구보다도 빠르게 사용을 해보고, 장단점을 정리하여 팀원들을 설득했습니다. 그리고 Eclipse에서 Android Studio로 넘어올때 필요한 설정들과 노하우들을 정리하여 사내 게시판에 정리하였고, 많은 팀들이 고맙다는 이야기를 메신저로 전해주어 굉장히 뿌듯했습니다.",
    "project_1 post story5 title": "사운드 포스트",
    "project_1 post story5": " 포스트에는 넘겨보는 카드형 에디터/뷰어가 있었습니다. 전 항상 이걸 보면서 여기에 누군가가 나레이션으로 읽어주거나 배경 음악이 나오면 좋겠다는 생각이 있었습니다. 기획팀에도 많이 이야기해 봤지만 더 중요한 일들이 우선순위에 있었기 때문에 그냥 재밌는 아이디어로 떠돌고 있었죠.\n\n 어느날 한성숙 서비스 총괄이사님이 네이버 밴드에 \"페이스북을 이길 수 있는 좋은 방법은 없을까요?\" 이런 댓글을 남기셨는데, 그날 아이디어를 더 구체화해서 아예 배경음악과 제 목소리를 입혀서 자동으로 넘어가는 동영상을 제작해서 올렸습니다.\n 생각보다 반응이 너무 괜찮았고, \"우리가 왜 이제껏 정적인 텍스트에만 너무 집중하고 있었을까요\" 이런 피드백을 받았습니다.(아마 이때부터 오디오클립에 대한 구상을 하셨던 것 같습니다.) 기획과 사운드 포스트 에디터에 대한 구체적인 UI 기획을 다듬고, 미팅을 주최하였는데 프로젝트로 선정이 됐습니다. 저는 당시 PM이자 안드로이드 개발자로 선택되어서 디자인 팀과, 법률 자문팀, 홍보팀 등과 소통하면서 약 2달만에 개발을 끝내고 성공적으로 출시를 하였습니다.\n\n 이 기능으로 가지고 핑크퐁과 동화구연 대회를 하여 많은 어머님들과 목소리 좋은 분들(성우급)이 약 5천개의 구연동화 컨텐츠를 올리기도 했습니다.",
    "project_2 blog story1 title": "갤러리 픽커",
    "project_2 blog story1": " 스마트에디터는 오래된 역사를 가진 네이버의 핵심 기능입니다.\n 블로그와, 네이버 포스트, 매거진 등에서 활용하여 긴 글을 읽기 좋고 멋지게 표현할 수 있죠.\n 저는 스마트 에디터 3.0에 들어가는 이미지 선택 갤러리를 만드는 작업을 했습니다.\n\n 그 외에 다양한 버그나, 크래시 등을 고치는 서스테인 업무를 주로 짧은 기간동안 진행하였습니다.",
    "project_3 disco story1 title": "서비스 Disco (최초에 이름은 UP)",
    "project_3 disco story1": " 네이버의 상징 그린팩토리, 그리고 27층 꼭대기로 올라갔습니다. 베일에 쌓여있는 비밀문을 열고 들어가니 네이버 포스트에서 같이 일하던 동료들이 저를 격렬히 맞이해주었습니다.\n\n 제가 네이버 포스트에서 사운드 포스트를 출시하고 서스테인 업무를 하는동안 네이버 포스트 모바일 개발진들은 일본 라인과 함께 진행하는 이 프로젝트에 모두 투입되어서 한창 개발을 하고 있었습니다.\n\n 저는 네이버 지도 API를 사용해 GPS 좌표를 활용한 커스텀 UI 디자인과, 지역 Viewer를 맡아서 작업을 했습니다.\n\n 당시에 유행하던 MVP 패턴과 MVI 패턴을 조합하여 Presenter와 Interactor라는 개념을 가지고 함께 개발을 하였는데, 복잡성만 유발되고, 오히려 맥락을 이해하는데 방해를 받는 느낌이 들었습니다. 하지만 당시에는 정확하게 어떤 부분 때문에 이러한 증상이 느껴졌는지 몰랐고, 팀원들이 미리 잡아주신 이 구조 안에서 최선을 다해 맡은바 개발을 진행했습니다.\n\n 출시가 얼마 안남은 시점에, 제 리소스는 남아 할게 없어졌기 때문에, 다시 네이버 블로그/포스트 서스테인 업무를 하기위해 1달정도 원래 팀으로 돌아갔습니다.\n\n 그리고… (오디오 클립 스토리를 봐주세요)",
    "project_4 audioclip story1 title": "최초의 커밋 그리고 오디오클립의 아버지",
    "project_4 audioclip story1": " 네이버에서 사운드 포스트를 런칭하고 약 1년 후, 커뮤니티 개발랩 랩장님이 조용히 부르시더니 지금 급하게 오디오 서비스를 기획하고 있고 조만간 개발이 들어갈 거라고 저에게 귀띔해주셨고, 다음주부터 팀을 옮기는게 어떻겠냐고 제안을 해주셨습니다.\n 저는 블로그/포스트 서비스 자체에 계속 애정이 있었기 때문에 남아서 사운드 포스트 기능을 더 업그레이드 시키고  싶은 마음에 조심스럽게 거절하였으나, 당시 서비스 총괄님이셨던 한성숙 대표님이 저를 지목했다고 꼭 가는게 좋겠다고 이야기해 주셔서 반강제로(?) 팀을 이동하였습니다.\n 당시 나와있던 최초 디자인과 기획물을 가지고 첫 프로토타입 앱을 만들고 데모 시범을 보여드렸었고, 실제 프로덕으로 진행하기로 결정이 나면서, 네이버 뮤직팀과 또 기타 여러 서비스 팀에서 사람들이 모였고 함께 개발을 정말 재밌고 활기차게 진행했습니다.\n 연차가 많지 않아 안드로이드 리딩을 하지는 않았지만, 오래 안드로이드를 해오신 선배님을 리더로 모시면서 역할 분배된대로 잘 이어나갔습니다.\n\n 저는 기초 아키텍팅을 제가 꼭 하고 싶다고 제안하였고, 리더님이 검수해주시는 조건하에 오픈소스 SVC의 기본 틀이 되는 형태로 구조를 잡아서 개발하였고, 그렇게 첫번째 버전이 스토어에 출시가 되었습니다.\n\n 첫번째로 커밋을 한 사람이 저였고, 사운드 포스트의 발명으로 인해서, 오디오 클립 서비스도 기획되고 진행되었기 때문에 팀원들이 저를 오디오클립의 아버지, 사운드 포스트의 아버지라고 우스갯 소리로 부르곤 했습니다.",
    "project_4 audioclip story2 title": "얼리 어답터2",
    "project_4 audioclip story2": " 오디오 클립 안드로이드 프로젝트에 처음으로 Kotlin을 도입했습니다. 프로토타입으로 써봤을때 java에 비해 코드가 굉장히 간결해지고, 수신 객체 람다 등을 사용해서 굉장히 다양한 표현을 할 수가 있었습니다. 또 기존의 코드에 영향을 주지 않고, 서로 소통할 수 있었기 때문에 팀장님과 팀원을 설득시켜 kotlin을 점차 도입하기로 했습니다.",
    "project_4 audioclip story3 title": "음성 인식 자연어 처리",
    "project_4 audioclip story3": " 오디오 클립 출시 후에 급작스럽게 기획 요청이 떨어졌습니다. 오디오 기술력을 오디오 클립 앱에서 보여주어야 하고, 음성 인식 기능이 포함되어야 하는데, 이를 개발할 수 있는 인력이나 시간이 없다는 것이었습니다. 약 1.5달 안에 출시를 해야하는 상황이었고, 누구도 나서지 않았으나 제가 개발할 수 있는 선에서는 해보고 싶었습니다. \n\n 지속 가능한 형태로 개발을 하려면 사실 머신러닝 기반의 명령 분석 시스템을 갖추어야하는데, 머신을 훈련 시키고 앱에서 구현될때까지의 시간은 없어서, 머신러닝 기반의 중간 부분은 나중으로 미루고, 음성인식 모듈을 붙여 마이크로부터 인식된 문장 텍스트를 받고, 이를 서버에 보내서 분석하게 한 뒤에 앱에서 실행할 수 있는 스킴 명령을 내려주는 형태로 설계했습니다.\n\n저는 서버에서 음성을 파싱한 문장을 받고 그 문장을 명사,조동사,조사,동사,목적격조사(을/를) 등으로 쪼개고 앱에서 실행 가능한 명령들의(재생해, 틀어줘, 찾아줘, 이동해줘) 조합을 통해 유저의 의도를 파악해서 스킴으로 변환시켜주는 기능을 JAVA로 개발하여 서버팀의 Repository에 기여했습니다.\n 구현을 완료하고 테스트했을때 기대했던 것 보다 가능한 명령들이 90%이상 성공률로 잘 동작하였기 때문에(제공한 가이드에 따른 명령들 기준), 오디오클립뿐 아니라 네이버 뮤직 서비스에도 동일한 기능을 붙여서 활용할 수 있었습니다.",
    "project_5 selective story1 title": "Android 아키텍팅",
    "project_5 selective story1": " 저는 팀에 합류할때 안드로이드 사진/동영상 편집 에디터의 기초 아키텍처와 사진 필터 기능등을 구현했습니다. 네이버 랩스팀이 만들어준 .SO 네이티브 필터가 있었기 때문에 NDK연동을 해서 사진에 다양한 필터와, Crop 기능 등을 구현하였고, 네이버 포스트와 블로그에서 직접 만들었던 Gallery Picker를 디자인 커스터마이징하여 제공했습니다.\n\n 또 당시 오픈소스로 공개했던 SVC 패턴 구조에 대해 팀과 논의하면서 서로 이해가 안되는 부분들은 구조를 변경하고 useCase였던 액션 클래스를 viewsAction이라는 이름으로 고치면서 더 명확한 형태를 만들었습니다. 그리고 합류하기 전에 있었던 화면들을 SVC 구조로 변경하면서, 코드를 단순화시켰습니다.",
    "project_5 selective story2 title": "React 웹 개발",
    "project_5 selective story2": " Android 개발만 6년을 해오다가 처음으로 React 웹프로젝트에 3달정도 기여를 할 수 있었습니다. 당시에 Redux를 빈번하게 사용하는 구조였는데, 좋아요 하트를 누를때 나오는 애니메이션이 데이터 처리가 Recursive하게 수행이되면서 눈에 보기 불편할 정도로 버벅임이 있었습니다. 이 원인을 파악하고, 또 애니메이션만 별도로 Redux를 사용하지 않는 형태로 리팩토링하여 문제를 해결했습니다. 그 외에 인플루언서 등록 페이지와 프로모션 페이지 등을 마크업 담당자와 분업하여 개발하였습니다.\n\n 짧은 시간이었지만 기존의 Android UI 개발과 전혀 다른 선언형 UI에 대한 이해를 할 수 있었던 시간이고, kolin에는 없던 자바스크립트의 자유로운 구조와 문법을 경험할 수 있었던 좋은 시간이었습니다. ",
    "project_6 lawfully story1 title": "초창기의 이야기",
    "project_6 lawfully story1": " 저는 로플리에 2019년 6월 27일에 안드로이드 개발 리드를 하기 위해 합류를 했습니다. 작업중인 안드로이드 앱이 있는데, 그 프로젝트를 완성해서 스토어에 런칭하기로 했죠.\n\n 입사 당시에 2018년 2월부터 1년 4개월동안 개발된 iOS 앱이 스토어에 런칭되어있었고,  2018년 12월에 출시된 앱은 제가 입사한 당시까지 약 7000명의 회원에 DAU 100명 정도에 불과한 초기 신생 어플리케이션이었습니다.\n\n 그런데 입사를 했을 때는 앱 프로젝트를 리딩하시던 iOS 개발자가 퇴사하여 부재중이었습니다. 소스코드를 인수인계 받고 배포 관련 profile 등을 전달 받아야했지만 연락이 안되는 상황이었고 멘붕에 빠졌죠. 유일하게 전달받은 git 저장소의 코드만 바라봤습니다.\n\n 심지어 외주를 통해 개발중이던 안드로이드앱은 개발 목표치의(당시 iOS 스펙의) 40% 정도만 개발이된 상태였고 나머지를 이어서 개발하기에는 구조나 코드도 엉망이었습니다.",
    "project_6 lawfully story2 title": "우리의 Flutter",
    "project_6 lawfully story2": " iOS를 이끌어갈 사람도 없고, Android쪽도 이어서 하자니 처음부터 구조를 잡는게 빠를 것 같았습니다. 당시 제가 관심이 있던 크로스플랫폼으로 Flutter가 점점 떠오르고 있었는데, 1.0.0이 출시된지 이제 6개월 정도가 되었습니다. 리서치를 해볼수록 UI성능과 OS플랫폼에 UI 디펜던시를 떼어낸 Flutter ’아! 이거다’ 싶었습니다.\n\n 당시에 iOS앱 자체도 계속 기능 변경과 업데이트를 해야했기 때문에 Swift 공부를 병행해가며 약 3개월동안 10번 정도의 iOS앱 릴리즈를 진행했고, Android앱 출시를 위해서 Flutter로 열심히 iOS앱을 따라 만들었습니다.\n\n 드디어 2019년 10월 21일 Android Flutter 버전앱이 출시되었습니다. 뒤따라 11월 초 Native iOS앱의 로그인 정보를 migration한 Flutter 앱을 AppStore에 업데이트 하였습니다. iOS유저들은 디자인만 조금 바뀌었다고 생각했습니다. 내부가 통째로 바뀐줄은 전혀 몰랐죠.\n\n 지난 4년을 돌아봤을때 Flutter를 선택한 것은 신의 한수였습니다. 기획과 디자인, 텍스트 전달도 Flutter를 위해 한벌만 만들면 되고, 개발 속도 자체도 Native 개발보다 더 빠르고 (Hot reload), 개발 완료 후의 테스트도 Android/iOS 2번하지 않더라도, 99%의 기능은 동일하게 동작하기 때문에 회사 전반적인 효율이 단순히 50%가 아니라, 커뮤니케이션 비용까지 감안하면 회사 입장에서는 70%정도를 세이브 하면서, 출시 주기를 기능별로 짧게 가져갈 수 있었습니다.",
    "project_6 lawfully story3 title": "다양한 기능들과 기술 구현",
    "project_6 lawfully story3": " Flutter 개발이 익숙해지고, 다양한 library들이 출시되면서 변호사와 화상 채팅이나(Agora) 신용카드 결제(Stripe) 연동이 손쉬워지면서, 계획으로만 가지고 있었던 기능들을 현실화할 수 있었습니다.\n\n 그 외에 Firebase에서 제공하는 A/B 테스팅이나 Firestore 기능과의 연동을 통해 Firestore DB 데이터 구조를 만들고 채팅 기능을 직접 개발하는데도 수월하게 진행할 수 있었습니다.",
    "project_6 lawfully story4 title": "지금은",
    "project_6 lawfully story4": " Lawfully는 전체 90만 다운로드, 그리고 등록된 유저 케이스 91만개, MAU 13만명을 기록하고 있습니다. 4년동안 유저 기준으로 8000% 성장을 했습니다. 이민하는 유저들 사이에서도 입소문을 통해 점점 더 알려지고 있으며 앞으로가 더 기대됩니다. ",
    "sort recent": "최신순으로 정렬하기",
    "sort old": "시간순으로 정렬하기",
    "media": "발표 및 미디어"
}